IDENTIFICATION DIVISION.
PROGRAM-ID. SOMA-NUMEROS.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUM1 PIC 9(5).
01 NUM2 PIC 9(5).
01 NUM3 PIC 9(5).
01 RESULTADO PIC 9(6).

PROCEDURE DIVISION.
    ACCEPT NUM1.
    ACCEPT NUM2.
    ACCEPT NUM3.
    ADD NUM1 NUM2 NUM3 GIVING RESULTADO.
    DISPLAY "Resultado: " RESULTADO.
    STOP RUN.